//---------------------------------------------------------------------------
// File: mywork.cpp
// By:   Nastya
//                                                     Индивидуальное задание
//---------------------------------------------------------------------------
#include "mywork.h"
//---------------------------------------------------------------------------
// Функция, выполняющая индивидуальное задание
//---------------------------------------------------------------------------
Text *doMyHomeWork(Text *text)
{
	cout << "Вариант 09" << endl;
	cout << "Оставить  в предложениях слова, отличающиеся от последнего\n";
	cout << "слова предложения, в которых буквы упорядочены по алфавиту.";
	cout << "\n\nИсходный текст: \n" << text;
	cout << "\nИзмененный текст: \n";
	for (int i = 0; i < text->size; ++i)
	{
		Word *last = text->sent[i]->word[text->sent[i]->size-1];
		for (int j = 0; j < text->sent[i]->size; ++j)
		{
			Word *w = text->sent[i]->word[j];
			if (strcmp(w->symbols, last->symbols) == 0) w->flag = true;
			for (unsigned k = 1; (k < strlen(w->symbols))&&(!w->flag); ++k)
				if (w->symbols[k] < w->symbols[k-1]) 
					w->flag = true;
			if (!w->flag)
				cout << *(w) << " ";
		}
	}
	cout << "\n\n";
	return text;
}
//---------------------------------------------------------------------------